app/controllers/admins_controller.rb

SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products"
---
  def show
    @categories = Category.all
    @products = Product.all