app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test category"], ["created_at", "2016-05-04 23:34:44.943220"], ["updated_at", "2016-05-04 23:34:44.943220"]]
---
  def create
    Category.create(cat_params)