app/controllers/products_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "products".* FROM "products" INNER JOIN "categories_products" ON "products"."id" = "categories_products"."product_id" WHERE "categories_products"."category_id" = $1  [["category_id", 1]]
---
  def index
    @category_id = params[:category_id]
    @products = Category.find(params[:category_id]).products.all

SELECT "categories".* FROM "categories"
---
  def new
    @categories = Category.all

INSERT INTO "products" ("name", "price", "description", "stock", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "aertgaerg"], ["price", "120.12"], ["description", "atrgrtgt"], ["stock", 1000], ["created_at", "2016-05-03 03:14:20.723041"], ["updated_at", "2016-05-03 03:14:20.723041"]]
INSERT INTO "categories_products" ("category_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 0], ["product_id", 2], ["created_at", "2016-05-05 03:09:20.093007"], ["updated_at", "2016-05-05 03:09:20.093007"]]
---
  def create
    @product = Product.new(product_params)
    if @product.valid?
      @product.save
      cat_params.each do |_, v|
        @product.categories_products.create(category_id: v.to_i)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" INNER JOIN "categories_products" ON "categories"."id" = "categories_products"."category_id" WHERE "categories_products"."product_id" = $1  [["product_id", 6]]
---
  def edit
    @product = Product.find(params[:id])
    @all_cats = Category.all
    @category_id = @product.categories.map { |x| x.id }

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "products" SET "name" = $1, "price" = $2, "description" = $3, "stock" = $4, "updated_at" = $5 WHERE "products"."id" = $6  [["name", "Best Computer"], ["price", "100.0"], ["description", "1000"], ["stock", 100], ["updated_at", "2016-05-03 23:33:18.025376"], ["id", 1]]
DELETE FROM "categories_products" WHERE "categories_products"."id" = $1  [["id", 17]]
SELECT "categories_products".* FROM "categories_products" WHERE "categories_products"."product_id" = $1  [["product_id", 8]]
INSERT INTO "categories_products" ("category_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 1], ["product_id", 8], ["created_at", "2016-05-05 03:57:36.989386"], ["updated_at", "2016-05-05 03:57:36.989386"]]
---
  def update
    @product = Product.find(params[:id])

    if @product
      @product.update_attributes(product_params)
      @product.categories_products.each { |record| record.destroy }
      cat_params.each do |_, v|
        @product.categories_products.create(category_id: v.to_i)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 2]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 2]]
---
  def destroy
    Product.find(params[:id]).destroy